// // Task 10 Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// int SecondNum (int threedigit)
// {
//     int num1 = (threedigit / 10 % 10);
//     return num1;
// }

// System.Console.Write("Введите трёхзначное число -> ");
// int threedigit = Convert.ToInt32(Console.ReadLine());

// System.Console.WriteLine(SecondNum(threedigit));